Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OSCCA.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWBR_cm33_core0
**                          MIMXRT735SGAWBR_cm33_core1
**                          MIMXRT735SGAWBR_ezhv
**                          MIMXRT735SGAWBR_hifi1
**                          MIMXRT735SGFOB_cm33_core0
**                          MIMXRT735SGFOB_cm33_core1
**                          MIMXRT735SGFOB_ezhv
**                          MIMXRT735SGFOB_hifi1
**                          MIMXRT758SGAWBR_cm33_core0
**                          MIMXRT758SGAWBR_cm33_core1
**                          MIMXRT758SGAWBR_ezhv
**                          MIMXRT758SGAWBR_hifi1
**                          MIMXRT758SGFOB_cm33_core0
**                          MIMXRT758SGFOB_cm33_core1
**                          MIMXRT758SGFOB_ezhv
**                          MIMXRT758SGFOB_hifi1
**                          MIMXRT798SGAWBR_cm33_core0
**                          MIMXRT798SGAWBR_cm33_core1
**                          MIMXRT798SGAWBR_ezhv
**                          MIMXRT798SGAWBR_hifi1
**                          MIMXRT798SGAWBR_hifi4
**                          MIMXRT798SGFOB_cm33_core0
**                          MIMXRT798SGFOB_cm33_core1
**                          MIMXRT798SGFOB_ezhv
**                          MIMXRT798SGFOB_hifi1
**                          MIMXRT798SGFOB_hifi4
**
**     Version:             rev. 4.0, 2025-06-06
**     Build:               b250606
**
**     Abstract:
**         CMSIS Peripheral Access Layer for OSCCA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**
** ###################################################################
*/

/*!
 * @file PERI_OSCCA.h
 * @version 4.0
 * @date 2025-06-06
 * @brief CMSIS Peripheral Access Layer for OSCCA
 *
 * CMSIS Peripheral Access Layer for OSCCA
 */

#if !defined(PERI_OSCCA_H_)
#define PERI_OSCCA_H_                            /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWBR_cm33_core0) || defined(CPU_MIMXRT735SGFOB_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_cm33_core1) || defined(CPU_MIMXRT735SGFOB_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_ezhv) || defined(CPU_MIMXRT735SGFOB_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_hifi1) || defined(CPU_MIMXRT735SGFOB_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core0) || defined(CPU_MIMXRT758SGFOB_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core1) || defined(CPU_MIMXRT758SGFOB_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_ezhv) || defined(CPU_MIMXRT758SGFOB_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_hifi1) || defined(CPU_MIMXRT758SGFOB_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core0) || defined(CPU_MIMXRT798SGFOB_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core1) || defined(CPU_MIMXRT798SGFOB_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_ezhv) || defined(CPU_MIMXRT798SGFOB_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi1) || defined(CPU_MIMXRT798SGFOB_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi4) || defined(CPU_MIMXRT798SGFOB_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- OSCCA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSCCA_Peripheral_Access_Layer OSCCA Peripheral Access Layer
 * @{
 */

/** OSCCA - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[512];
  __IO uint32_t SAFO_SGI_DATIN0A;                  /**< Input Data register 0 lower-bank low, offset: 0x200 */
  __IO uint32_t SAFO_SGI_DATIN0B;                  /**< Input Data register 0 lower-bank high, offset: 0x204 */
  __IO uint32_t SAFO_SGI_DATIN0C;                  /**< Input Data register 0 upper-bank low, offset: 0x208 */
  __IO uint32_t SAFO_SGI_DATIN0D;                  /**< Input Data register 0 upper-bank high, offset: 0x20C */
  __IO uint32_t SAFO_SGI_DATIN1A;                  /**< Input Data register 1 lower-bank low, offset: 0x210 */
  __IO uint32_t SAFO_SGI_DATIN1B;                  /**< Input Data register 1 lower-bank high, offset: 0x214 */
  __IO uint32_t SAFO_SGI_DATIN1C;                  /**< Input Data register 1 upper-bank low, offset: 0x218 */
  __IO uint32_t SAFO_SGI_DATIN1D;                  /**< Input Data register 1 upper-bank high, offset: 0x21C */
       uint8_t RESERVED_1[32];
  __IO uint32_t SAFO_SGI_KEY0A;                    /**< Input Key register 0 lower-bank low, offset: 0x240 */
  __IO uint32_t SAFO_SGI_KEY0B;                    /**< Input Key register 0 lower-bank high, offset: 0x244 */
  __IO uint32_t SAFO_SGI_KEY0C;                    /**< Input Key register 0 upper-bank low, offset: 0x248 */
  __IO uint32_t SAFO_SGI_KEY0D;                    /**< Input Key register 0 upper-bank high, offset: 0x24C */
  __IO uint32_t SAFO_SGI_KEY1A;                    /**< Input Key register 1 lower-bank low, offset: 0x250 */
  __IO uint32_t SAFO_SGI_KEY1B;                    /**< Input Key register 1 lower-bank high, offset: 0x254 */
  __IO uint32_t SAFO_SGI_KEY1C;                    /**< Input Key register 1 upper-bank low, offset: 0x258 */
  __IO uint32_t SAFO_SGI_KEY1D;                    /**< Input Key register 1 upper-bank high, offset: 0x25C */
       uint8_t RESERVED_2[96];
  __I  uint32_t SAFO_SGI_DATOUTA;                  /**< Output Data register lower-bank low, offset: 0x2C0 */
  __I  uint32_t SAFO_SGI_DATOUTB;                  /**< Ouput Data register lower-bank high, offset: 0x2C4 */
  __I  uint32_t SAFO_SGI_DATOUTC;                  /**< Ouput Data register upper-bank low, offset: 0x2C8 */
  __I  uint32_t SAFO_SGI_DATOUTD;                  /**< Output Data register upper-bank high, offset: 0x2CC */
       uint8_t RESERVED_3[2352];
  __I  uint32_t SAFO_SGI_STATUS;                   /**< Status Register, offset: 0xC00 */
  __IO uint32_t SAFO_SGI_COUNT;                    /**< Calculation Counter, offset: 0xC04 */
       uint8_t RESERVED_4[248];
  __IO uint32_t SAFO_SGI_CTRL;                     /**< SGI Control Register, offset: 0xD00 */
  __IO uint32_t SAFO_SGI_CTRL2;                    /**< SGI Control Register 2, offset: 0xD04 */
       uint8_t RESERVED_5[12];
  __IO uint32_t SAFO_SGI_SM3_CTRL;                 /**< SM3 Control Register, offset: 0xD14 */
  __IO uint32_t SAFO_SGI_SM3_FIFO;                 /**< SM3 FIFO Register, offset: 0xD18 */
  __I  uint32_t SAFO_SGI_CONFIG;                   /**< SGI Configuration Register, offset: 0xD1C */
       uint8_t RESERVED_6[708];
  __IO uint32_t SAFO_SGI_INT_ENABLE;               /**< Interrupt Enable, offset: 0xFE4 */
  __O  uint32_t SAFO_SGI_INT_STATUS_CLR;           /**< Interrupt Status Clear, offset: 0xFE8 */
  __O  uint32_t SAFO_SGI_INT_STATUS_SET;           /**< Interrupt Status Set, offset: 0xFEC */
} OSCCA_Type;

/* ----------------------------------------------------------------------------
   -- OSCCA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSCCA_Register_Masks OSCCA Register Masks
 * @{
 */

