Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OSCCA.h
/*! @name SAFO_SGI_DATIN0A - Input Data register 0 lower-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN0A_DATIN0A_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN0A_DATIN0A_SHIFT     (0U)
/*! DATIN0A - Input Data register */
#define OSCCA_SAFO_SGI_DATIN0A_DATIN0A(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN0A_DATIN0A_SHIFT)) & OSCCA_SAFO_SGI_DATIN0A_DATIN0A_MASK)
/*! @} */

/*! @name SAFO_SGI_DATIN0B - Input Data register 0 lower-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN0B_DATIN0B_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN0B_DATIN0B_SHIFT     (0U)
/*! DATIN0B - Input Data register */
#define OSCCA_SAFO_SGI_DATIN0B_DATIN0B(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN0B_DATIN0B_SHIFT)) & OSCCA_SAFO_SGI_DATIN0B_DATIN0B_MASK)
/*! @} */

/*! @name SAFO_SGI_DATIN0C - Input Data register 0 upper-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN0C_DATIN0C_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN0C_DATIN0C_SHIFT     (0U)
/*! DATIN0C - Input Data register */
#define OSCCA_SAFO_SGI_DATIN0C_DATIN0C(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN0C_DATIN0C_SHIFT)) & OSCCA_SAFO_SGI_DATIN0C_DATIN0C_MASK)
/*! @} */

/*! @name SAFO_SGI_DATIN0D - Input Data register 0 upper-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN0D_DATIN0D_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN0D_DATIN0D_SHIFT     (0U)
/*! DATIN0D - Input Data register */
#define OSCCA_SAFO_SGI_DATIN0D_DATIN0D(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN0D_DATIN0D_SHIFT)) & OSCCA_SAFO_SGI_DATIN0D_DATIN0D_MASK)
/*! @} */

/*! @name SAFO_SGI_DATIN1A - Input Data register 1 lower-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN1A_DATIN1A_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN1A_DATIN1A_SHIFT     (0U)
/*! DATIN1A - Input Data register */
#define OSCCA_SAFO_SGI_DATIN1A_DATIN1A(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN1A_DATIN1A_SHIFT)) & OSCCA_SAFO_SGI_DATIN1A_DATIN1A_MASK)
/*! @} */

/*! @name SAFO_SGI_DATIN1B - Input Data register 1 lower-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN1B_DATIN1B_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN1B_DATIN1B_SHIFT     (0U)
/*! DATIN1B - Input Data register */
#define OSCCA_SAFO_SGI_DATIN1B_DATIN1B(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN1B_DATIN1B_SHIFT)) & OSCCA_SAFO_SGI_DATIN1B_DATIN1B_MASK)
/*! @} */

/*! @name SAFO_SGI_DATIN1C - Input Data register 1 upper-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN1C_DATIN1C_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN1C_DATIN1C_SHIFT     (0U)
/*! DATIN1C - Input Data register */
#define OSCCA_SAFO_SGI_DATIN1C_DATIN1C(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN1C_DATIN1C_SHIFT)) & OSCCA_SAFO_SGI_DATIN1C_DATIN1C_MASK)
/*! @} */

/*! @name SAFO_SGI_DATIN1D - Input Data register 1 upper-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_DATIN1D_DATIN1D_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATIN1D_DATIN1D_SHIFT     (0U)
/*! DATIN1D - Input Data register */
#define OSCCA_SAFO_SGI_DATIN1D_DATIN1D(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATIN1D_DATIN1D_SHIFT)) & OSCCA_SAFO_SGI_DATIN1D_DATIN1D_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY0A - Input Key register 0 lower-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY0A_KEY0A_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY0A_KEY0A_SHIFT         (0U)
/*! KEY0A - Input Key register */
#define OSCCA_SAFO_SGI_KEY0A_KEY0A(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY0A_KEY0A_SHIFT)) & OSCCA_SAFO_SGI_KEY0A_KEY0A_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY0B - Input Key register 0 lower-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY0B_KEY0B_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY0B_KEY0B_SHIFT         (0U)
/*! KEY0B - Input Key register */
#define OSCCA_SAFO_SGI_KEY0B_KEY0B(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY0B_KEY0B_SHIFT)) & OSCCA_SAFO_SGI_KEY0B_KEY0B_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY0C - Input Key register 0 upper-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY0C_KEY0C_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY0C_KEY0C_SHIFT         (0U)
/*! KEY0C - Input Key register */
#define OSCCA_SAFO_SGI_KEY0C_KEY0C(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY0C_KEY0C_SHIFT)) & OSCCA_SAFO_SGI_KEY0C_KEY0C_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY0D - Input Key register 0 upper-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY0D_KEY0D_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY0D_KEY0D_SHIFT         (0U)
/*! KEY0D - Input Key register */
#define OSCCA_SAFO_SGI_KEY0D_KEY0D(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY0D_KEY0D_SHIFT)) & OSCCA_SAFO_SGI_KEY0D_KEY0D_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY1A - Input Key register 1 lower-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY1A_KEY1A_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY1A_KEY1A_SHIFT         (0U)
/*! KEY1A - Input Key register */
#define OSCCA_SAFO_SGI_KEY1A_KEY1A(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY1A_KEY1A_SHIFT)) & OSCCA_SAFO_SGI_KEY1A_KEY1A_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY1B - Input Key register 1 lower-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY1B_KEY1B_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY1B_KEY1B_SHIFT         (0U)
/*! KEY1B - Input Key register */
#define OSCCA_SAFO_SGI_KEY1B_KEY1B(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY1B_KEY1B_SHIFT)) & OSCCA_SAFO_SGI_KEY1B_KEY1B_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY1C - Input Key register 1 upper-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY1C_KEY1C_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY1C_KEY1C_SHIFT         (0U)
/*! KEY1C - Input Key register */
#define OSCCA_SAFO_SGI_KEY1C_KEY1C(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY1C_KEY1C_SHIFT)) & OSCCA_SAFO_SGI_KEY1C_KEY1C_MASK)
/*! @} */

/*! @name SAFO_SGI_KEY1D - Input Key register 1 upper-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_KEY1D_KEY1D_MASK          (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_KEY1D_KEY1D_SHIFT         (0U)
/*! KEY1D - Input Key register */
#define OSCCA_SAFO_SGI_KEY1D_KEY1D(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_KEY1D_KEY1D_SHIFT)) & OSCCA_SAFO_SGI_KEY1D_KEY1D_MASK)
/*! @} */

