Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OSCCA.h
/*! @name SAFO_SGI_DATOUTA - Output Data register lower-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_DATOUTA_DATOUTA_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATOUTA_DATOUTA_SHIFT     (0U)
/*! DATOUTA - Output Data register */
#define OSCCA_SAFO_SGI_DATOUTA_DATOUTA(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATOUTA_DATOUTA_SHIFT)) & OSCCA_SAFO_SGI_DATOUTA_DATOUTA_MASK)
/*! @} */

/*! @name SAFO_SGI_DATOUTB - Ouput Data register lower-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_DATOUTB_DATOUTB_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATOUTB_DATOUTB_SHIFT     (0U)
/*! DATOUTB - Ouput Data register */
#define OSCCA_SAFO_SGI_DATOUTB_DATOUTB(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATOUTB_DATOUTB_SHIFT)) & OSCCA_SAFO_SGI_DATOUTB_DATOUTB_MASK)
/*! @} */

/*! @name SAFO_SGI_DATOUTC - Ouput Data register upper-bank low */
/*! @{ */

#define OSCCA_SAFO_SGI_DATOUTC_DATOUTC_MASK      (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATOUTC_DATOUTC_SHIFT     (0U)
/*! DATOUTC - Ouput Data register */
#define OSCCA_SAFO_SGI_DATOUTC_DATOUTC(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATOUTC_DATOUTC_SHIFT)) & OSCCA_SAFO_SGI_DATOUTC_DATOUTC_MASK)
/*! @} */

/*! @name SAFO_SGI_DATOUTD - Output Data register upper-bank high */
/*! @{ */

#define OSCCA_SAFO_SGI_DATOUTD_DOUTD_MASK        (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_DATOUTD_DOUTD_SHIFT       (0U)
/*! DOUTD - Output Data register */
#define OSCCA_SAFO_SGI_DATOUTD_DOUTD(x)          (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_DATOUTD_DOUTD_SHIFT)) & OSCCA_SAFO_SGI_DATOUTD_DOUTD_MASK)
/*! @} */

/*! @name SAFO_SGI_STATUS - Status Register */
/*! @{ */

#define OSCCA_SAFO_SGI_STATUS_BUSY_MASK          (0x1U)
#define OSCCA_SAFO_SGI_STATUS_BUSY_SHIFT         (0U)
/*! BUSY - Busy Flag */
#define OSCCA_SAFO_SGI_STATUS_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_BUSY_SHIFT)) & OSCCA_SAFO_SGI_STATUS_BUSY_MASK)

#define OSCCA_SAFO_SGI_STATUS_OFLOW_MASK         (0x2U)
#define OSCCA_SAFO_SGI_STATUS_OFLOW_SHIFT        (1U)
/*! OFLOW - Overflow Flag */
#define OSCCA_SAFO_SGI_STATUS_OFLOW(x)           (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_OFLOW_SHIFT)) & OSCCA_SAFO_SGI_STATUS_OFLOW_MASK)

#define OSCCA_SAFO_SGI_STATUS_PRNG_RDY_MASK      (0x4U)
#define OSCCA_SAFO_SGI_STATUS_PRNG_RDY_SHIFT     (2U)
/*! PRNG_RDY - PRNG Ready */
#define OSCCA_SAFO_SGI_STATUS_PRNG_RDY(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_PRNG_RDY_SHIFT)) & OSCCA_SAFO_SGI_STATUS_PRNG_RDY_MASK)

#define OSCCA_SAFO_SGI_STATUS_ERROR_MASK         (0x38U)
#define OSCCA_SAFO_SGI_STATUS_ERROR_SHIFT        (3U)
/*! ERROR - Error Indicator */
#define OSCCA_SAFO_SGI_STATUS_ERROR(x)           (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_ERROR_SHIFT)) & OSCCA_SAFO_SGI_STATUS_ERROR_MASK)

#define OSCCA_SAFO_SGI_STATUS_SM3_BUSY_MASK      (0x40U)
#define OSCCA_SAFO_SGI_STATUS_SM3_BUSY_SHIFT     (6U)
/*! SM3_BUSY - SM3 Busy Status Flag */
#define OSCCA_SAFO_SGI_STATUS_SM3_BUSY(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_SM3_BUSY_SHIFT)) & OSCCA_SAFO_SGI_STATUS_SM3_BUSY_MASK)

#define OSCCA_SAFO_SGI_STATUS_IRQ_MASK           (0x80U)
#define OSCCA_SAFO_SGI_STATUS_IRQ_SHIFT          (7U)
/*! IRQ - Interrupt Status Flag */
#define OSCCA_SAFO_SGI_STATUS_IRQ(x)             (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_IRQ_SHIFT)) & OSCCA_SAFO_SGI_STATUS_IRQ_MASK)

#define OSCCA_SAFO_SGI_STATUS_SM3_FIFO_FULL_MASK (0x100U)
#define OSCCA_SAFO_SGI_STATUS_SM3_FIFO_FULL_SHIFT (8U)
/*! SM3_FIFO_FULL - SM3 FIFO Full Indicator */
#define OSCCA_SAFO_SGI_STATUS_SM3_FIFO_FULL(x)   (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_SM3_FIFO_FULL_SHIFT)) & OSCCA_SAFO_SGI_STATUS_SM3_FIFO_FULL_MASK)

#define OSCCA_SAFO_SGI_STATUS_SM3_FIFO_LEVEL_MASK (0x7E00U)
#define OSCCA_SAFO_SGI_STATUS_SM3_FIFO_LEVEL_SHIFT (9U)
/*! SM3_FIFO_LEVEL - SM3 FIFO Level */
#define OSCCA_SAFO_SGI_STATUS_SM3_FIFO_LEVEL(x)  (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_SM3_FIFO_LEVEL_SHIFT)) & OSCCA_SAFO_SGI_STATUS_SM3_FIFO_LEVEL_MASK)

#define OSCCA_SAFO_SGI_STATUS_SM3_ERROR_MASK     (0x8000U)
#define OSCCA_SAFO_SGI_STATUS_SM3_ERROR_SHIFT    (15U)
/*! SM3_ERROR - SM3 ERROR */
#define OSCCA_SAFO_SGI_STATUS_SM3_ERROR(x)       (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_STATUS_SM3_ERROR_SHIFT)) & OSCCA_SAFO_SGI_STATUS_SM3_ERROR_MASK)
/*! @} */

/*! @name SAFO_SGI_COUNT - Calculation Counter */
/*! @{ */

#define OSCCA_SAFO_SGI_COUNT_COUNT_MASK          (0xFFFFU)
#define OSCCA_SAFO_SGI_COUNT_COUNT_SHIFT         (0U)
/*! COUNT - Calculation Counter */
#define OSCCA_SAFO_SGI_COUNT_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_COUNT_COUNT_SHIFT)) & OSCCA_SAFO_SGI_COUNT_COUNT_MASK)
/*! @} */

/*! @name SAFO_SGI_CTRL - SGI Control Register */
/*! @{ */

#define OSCCA_SAFO_SGI_CTRL_START_MASK           (0x1U)
#define OSCCA_SAFO_SGI_CTRL_START_SHIFT          (0U)
/*! START - Start Crypto Operation */
#define OSCCA_SAFO_SGI_CTRL_START(x)             (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_START_SHIFT)) & OSCCA_SAFO_SGI_CTRL_START_MASK)

#define OSCCA_SAFO_SGI_CTRL_DECRYPT_MASK         (0x2U)
#define OSCCA_SAFO_SGI_CTRL_DECRYPT_SHIFT        (1U)
/*! DECRYPT - Sets Cipher direction(SM4) */
#define OSCCA_SAFO_SGI_CTRL_DECRYPT(x)           (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_DECRYPT_SHIFT)) & OSCCA_SAFO_SGI_CTRL_DECRYPT_MASK)

#define OSCCA_SAFO_SGI_CTRL_CRYPTO_OP_MASK       (0x70U)
#define OSCCA_SAFO_SGI_CTRL_CRYPTO_OP_SHIFT      (4U)
/*! CRYPTO_OP - Crypto Operation Type */
#define OSCCA_SAFO_SGI_CTRL_CRYPTO_OP(x)         (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_CRYPTO_OP_SHIFT)) & OSCCA_SAFO_SGI_CTRL_CRYPTO_OP_MASK)

#define OSCCA_SAFO_SGI_CTRL_INSEL_MASK           (0x780U)
#define OSCCA_SAFO_SGI_CTRL_INSEL_SHIFT          (7U)
/*! INSEL - Kernel Input Configuration */
#define OSCCA_SAFO_SGI_CTRL_INSEL(x)             (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_INSEL_SHIFT)) & OSCCA_SAFO_SGI_CTRL_INSEL_MASK)

#define OSCCA_SAFO_SGI_CTRL_OUTSEL_MASK          (0x3800U)
#define OSCCA_SAFO_SGI_CTRL_OUTSEL_SHIFT         (11U)
/*! OUTSEL - Kernel Input Configuration */
#define OSCCA_SAFO_SGI_CTRL_OUTSEL(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_OUTSEL_SHIFT)) & OSCCA_SAFO_SGI_CTRL_OUTSEL_MASK)

