Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OSCCA.h
#define OSCCA_SAFO_SGI_CTRL_DATOUT_RES_MASK      (0xC000U)
#define OSCCA_SAFO_SGI_CTRL_DATOUT_RES_SHIFT     (14U)
/*! DATOUT_RES - Kernels Data Out Options */
#define OSCCA_SAFO_SGI_CTRL_DATOUT_RES(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_DATOUT_RES_SHIFT)) & OSCCA_SAFO_SGI_CTRL_DATOUT_RES_MASK)

#define OSCCA_SAFO_SGI_CTRL_INKEYSEL_MASK        (0x1F00000U)
#define OSCCA_SAFO_SGI_CTRL_INKEYSEL_SHIFT       (20U)
/*! INKEYSEL - Input key selection */
#define OSCCA_SAFO_SGI_CTRL_INKEYSEL(x)          (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_INKEYSEL_SHIFT)) & OSCCA_SAFO_SGI_CTRL_INKEYSEL_MASK)

#define OSCCA_SAFO_SGI_CTRL_SM4_EN_MASK          (0x8000000U)
#define OSCCA_SAFO_SGI_CTRL_SM4_EN_SHIFT         (27U)
/*! SM4_EN - SM4 Kernel Enable */
#define OSCCA_SAFO_SGI_CTRL_SM4_EN(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_SM4_EN_SHIFT)) & OSCCA_SAFO_SGI_CTRL_SM4_EN_MASK)

#define OSCCA_SAFO_SGI_CTRL_SM4_NO_KL_MASK       (0x10000000U)
#define OSCCA_SAFO_SGI_CTRL_SM4_NO_KL_SHIFT      (28U)
/*! SM4_NO_KL - SM4 No Decryption Key Schedule */
#define OSCCA_SAFO_SGI_CTRL_SM4_NO_KL(x)         (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL_SM4_NO_KL_SHIFT)) & OSCCA_SAFO_SGI_CTRL_SM4_NO_KL_MASK)
/*! @} */

/*! @name SAFO_SGI_CTRL2 - SGI Control Register 2 */
/*! @{ */

#define OSCCA_SAFO_SGI_CTRL2_FLUSH_MASK          (0x1U)
#define OSCCA_SAFO_SGI_CTRL2_FLUSH_SHIFT         (0U)
/*! FLUSH - Start Full SGI Flush */
#define OSCCA_SAFO_SGI_CTRL2_FLUSH(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_FLUSH_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_FLUSH_MASK)

#define OSCCA_SAFO_SGI_CTRL2_KEY_FLUSH_MASK      (0x2U)
#define OSCCA_SAFO_SGI_CTRL2_KEY_FLUSH_SHIFT     (1U)
/*! KEY_FLUSH - Start KEY register-bank Flush */
#define OSCCA_SAFO_SGI_CTRL2_KEY_FLUSH(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_KEY_FLUSH_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_KEY_FLUSH_MASK)

#define OSCCA_SAFO_SGI_CTRL2_DATIN_FLUSH_MASK    (0x4U)
#define OSCCA_SAFO_SGI_CTRL2_DATIN_FLUSH_SHIFT   (2U)
/*! DATIN_FLUSH - Start DATIN register-bank Flush */
#define OSCCA_SAFO_SGI_CTRL2_DATIN_FLUSH(x)      (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_DATIN_FLUSH_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_DATIN_FLUSH_MASK)

#define OSCCA_SAFO_SGI_CTRL2_INCR_MASK           (0x8U)
#define OSCCA_SAFO_SGI_CTRL2_INCR_SHIFT          (3U)
/*! INCR - Increment(Triggered by SFR write) */
#define OSCCA_SAFO_SGI_CTRL2_INCR(x)             (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_INCR_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_INCR_MASK)

#define OSCCA_SAFO_SGI_CTRL2_XORWR_MASK          (0x10U)
#define OSCCA_SAFO_SGI_CTRL2_XORWR_SHIFT         (4U)
/*! XORWR - Write-XOR control */
#define OSCCA_SAFO_SGI_CTRL2_XORWR(x)            (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_XORWR_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_XORWR_MASK)

#define OSCCA_SAFO_SGI_CTRL2_FLUSHWR_MASK        (0x20U)
#define OSCCA_SAFO_SGI_CTRL2_FLUSHWR_SHIFT       (5U)
/*! FLUSHWR - Flush Write control */
#define OSCCA_SAFO_SGI_CTRL2_FLUSHWR(x)          (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_FLUSHWR_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_FLUSHWR_MASK)

#define OSCCA_SAFO_SGI_CTRL2_INCR_CIN_MASK       (0x40U)
#define OSCCA_SAFO_SGI_CTRL2_INCR_CIN_SHIFT      (6U)
/*! INCR_CIN - Increment Carry-In control */
#define OSCCA_SAFO_SGI_CTRL2_INCR_CIN(x)         (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_INCR_CIN_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_INCR_CIN_MASK)

#define OSCCA_SAFO_SGI_CTRL2_KEYRES_MASK         (0x1F0000U)
#define OSCCA_SAFO_SGI_CTRL2_KEYRES_SHIFT        (16U)
/*! KEYRES - Selects key registers to be updated when RKEY=1 */
#define OSCCA_SAFO_SGI_CTRL2_KEYRES(x)           (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_KEYRES_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_KEYRES_MASK)

#define OSCCA_SAFO_SGI_CTRL2_RKEY_MASK           (0x200000U)
#define OSCCA_SAFO_SGI_CTRL2_RKEY_SHIFT          (21U)
/*! RKEY - Crypto result location */
#define OSCCA_SAFO_SGI_CTRL2_RKEY(x)             (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_RKEY_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_RKEY_MASK)

#define OSCCA_SAFO_SGI_CTRL2_BYTES_ORDER_MASK    (0x400000U)
#define OSCCA_SAFO_SGI_CTRL2_BYTES_ORDER_SHIFT   (22U)
/*! BYTES_ORDER - Byte order of regbank read/write data */
#define OSCCA_SAFO_SGI_CTRL2_BYTES_ORDER(x)      (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CTRL2_BYTES_ORDER_SHIFT)) & OSCCA_SAFO_SGI_CTRL2_BYTES_ORDER_MASK)
/*! @} */

/*! @name SAFO_SGI_SM3_CTRL - SM3 Control Register */
/*! @{ */

#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_MODE_MASK    (0x2U)
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_MODE_SHIFT   (1U)
/*! SM3_MODE - SM3 mode normal or automatic */
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_MODE(x)      (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_SM3_MODE_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_SM3_MODE_MASK)

#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_LOW_LIM_MASK (0xF0U)
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_LOW_LIM_SHIFT (4U)
/*! SM3_LOW_LIM - SM3 FIFO low limit */
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_LOW_LIM(x)   (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_SM3_LOW_LIM_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_SM3_LOW_LIM_MASK)

#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_HIGH_LIM_MASK (0xF00U)
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_HIGH_LIM_SHIFT (8U)
/*! SM3_HIGH_LIM - SM3 FIFO high limit */
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_HIGH_LIM(x)  (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_SM3_HIGH_LIM_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_SM3_HIGH_LIM_MASK)

#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_COUNT_EN_MASK (0x1000U)
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_COUNT_EN_SHIFT (12U)
/*! SM3_COUNT_EN - SM3 Calculation Counter Enable */
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_COUNT_EN(x)  (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_SM3_COUNT_EN_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_SM3_COUNT_EN_MASK)

#define OSCCA_SAFO_SGI_SM3_CTRL_HASH_RELOAD_MASK (0x2000U)
#define OSCCA_SAFO_SGI_SM3_CTRL_HASH_RELOAD_SHIFT (13U)
/*! HASH_RELOAD - SM3 HASH reload */
#define OSCCA_SAFO_SGI_SM3_CTRL_HASH_RELOAD(x)   (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_HASH_RELOAD_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_HASH_RELOAD_MASK)

#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_STOP_MASK    (0x4000U)
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_STOP_SHIFT   (14U)
/*! SM3_STOP - STOP SM3 AUTO mode */
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_STOP(x)      (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_SM3_STOP_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_SM3_STOP_MASK)

#define OSCCA_SAFO_SGI_SM3_CTRL_NO_AUTO_INIT_MASK (0x8000U)
#define OSCCA_SAFO_SGI_SM3_CTRL_NO_AUTO_INIT_SHIFT (15U)
/*! NO_AUTO_INIT - SM3 no automatic HASH initialisation */
#define OSCCA_SAFO_SGI_SM3_CTRL_NO_AUTO_INIT(x)  (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_NO_AUTO_INIT_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_NO_AUTO_INIT_MASK)

#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_EN_MASK      (0x10000U)
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_EN_SHIFT     (16U)
/*! SM3_EN - SM3 enable */
#define OSCCA_SAFO_SGI_SM3_CTRL_SM3_EN(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_CTRL_SM3_EN_SHIFT)) & OSCCA_SAFO_SGI_SM3_CTRL_SM3_EN_MASK)
/*! @} */

/*! @name SAFO_SGI_SM3_FIFO - SM3 FIFO Register */
/*! @{ */

#define OSCCA_SAFO_SGI_SM3_FIFO_FIFO_MASK        (0xFFFFFFFFU)
#define OSCCA_SAFO_SGI_SM3_FIFO_FIFO_SHIFT       (0U)
/*! FIFO - SM3 FIFO Register */
#define OSCCA_SAFO_SGI_SM3_FIFO_FIFO(x)          (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_SM3_FIFO_FIFO_SHIFT)) & OSCCA_SAFO_SGI_SM3_FIFO_FIFO_MASK)
/*! @} */

/*! @name SAFO_SGI_CONFIG - SGI Configuration Register */
/*! @{ */

#define OSCCA_SAFO_SGI_CONFIG_HAS_CMAC_MASK      (0x80U)
#define OSCCA_SAFO_SGI_CONFIG_HAS_CMAC_SHIFT     (7U)
/*! HAS_CMAC - Has CMAC */
#define OSCCA_SAFO_SGI_CONFIG_HAS_CMAC(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_HAS_CMAC_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_HAS_CMAC_MASK)

#define OSCCA_SAFO_SGI_CONFIG_HAS_GFMUL_MASK     (0x100U)
#define OSCCA_SAFO_SGI_CONFIG_HAS_GFMUL_SHIFT    (8U)
/*! HAS_GFMUL - Has GFMUL */
#define OSCCA_SAFO_SGI_CONFIG_HAS_GFMUL(x)       (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_HAS_GFMUL_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_HAS_GFMUL_MASK)

#define OSCCA_SAFO_SGI_CONFIG_INTERNAL_PRNG_MASK (0x200U)
#define OSCCA_SAFO_SGI_CONFIG_INTERNAL_PRNG_SHIFT (9U)
/*! INTERNAL_PRNG - Has internal PRNG */
#define OSCCA_SAFO_SGI_CONFIG_INTERNAL_PRNG(x)   (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_INTERNAL_PRNG_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_INTERNAL_PRNG_MASK)

#define OSCCA_SAFO_SGI_CONFIG_KEY_DIGEST_MASK    (0x400U)
#define OSCCA_SAFO_SGI_CONFIG_KEY_DIGEST_SHIFT   (10U)
/*! KEY_DIGEST - Has key digest */
#define OSCCA_SAFO_SGI_CONFIG_KEY_DIGEST(x)      (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_KEY_DIGEST_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_KEY_DIGEST_MASK)

#define OSCCA_SAFO_SGI_CONFIG_FA_MASK            (0x2000U)
#define OSCCA_SAFO_SGI_CONFIG_FA_SHIFT           (13U)
/*! FA - Has FA protection */
#define OSCCA_SAFO_SGI_CONFIG_FA(x)              (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_FA_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_FA_MASK)

#define OSCCA_SAFO_SGI_CONFIG_BUS_WIDTH_MASK     (0x8000U)
#define OSCCA_SAFO_SGI_CONFIG_BUS_WIDTH_SHIFT    (15U)
/*! BUS_WIDTH - Bus width */
#define OSCCA_SAFO_SGI_CONFIG_BUS_WIDTH(x)       (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_BUS_WIDTH_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_BUS_WIDTH_MASK)

#define OSCCA_SAFO_SGI_CONFIG_NUM_DATIN_MASK     (0x30000U)
#define OSCCA_SAFO_SGI_CONFIG_NUM_DATIN_SHIFT    (16U)
/*! NUM_DATIN - Number DATIN */
#define OSCCA_SAFO_SGI_CONFIG_NUM_DATIN(x)       (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_NUM_DATIN_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_NUM_DATIN_MASK)

#define OSCCA_SAFO_SGI_CONFIG_NUM_KEY_MASK       (0x1C0000U)
#define OSCCA_SAFO_SGI_CONFIG_NUM_KEY_SHIFT      (18U)
/*! NUM_KEY - Number KEY */
#define OSCCA_SAFO_SGI_CONFIG_NUM_KEY(x)         (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_NUM_KEY_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_NUM_KEY_MASK)

#define OSCCA_SAFO_SGI_CONFIG_EDC_MASK           (0x200000U)
#define OSCCA_SAFO_SGI_CONFIG_EDC_SHIFT          (21U)
/*! EDC - EDC enable */
#define OSCCA_SAFO_SGI_CONFIG_EDC(x)             (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_EDC_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_EDC_MASK)

#define OSCCA_SAFO_SGI_CONFIG_DUAL_SGI_MASK      (0x400000U)
#define OSCCA_SAFO_SGI_CONFIG_DUAL_SGI_SHIFT     (22U)
/*! DUAL_SGI - Has dual SGI */
#define OSCCA_SAFO_SGI_CONFIG_DUAL_SGI(x)        (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_DUAL_SGI_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_DUAL_SGI_MASK)

#define OSCCA_SAFO_SGI_CONFIG_SHA_256_ONLY_MASK  (0x1000000U)
#define OSCCA_SAFO_SGI_CONFIG_SHA_256_ONLY_SHIFT (24U)
/*! SHA_256_ONLY - Has SHA 256 only */
#define OSCCA_SAFO_SGI_CONFIG_SHA_256_ONLY(x)    (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_SHA_256_ONLY_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_SHA_256_ONLY_MASK)

