Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_OSCCA.h
#define OSCCA_SAFO_SGI_CONFIG_SPB_SUPPORT_MASK   (0x2000000U)
#define OSCCA_SAFO_SGI_CONFIG_SPB_SUPPORT_SHIFT  (25U)
/*! SPB_SUPPORT - ID_CFG_SPB_SUPPORT is set */
#define OSCCA_SAFO_SGI_CONFIG_SPB_SUPPORT(x)     (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_SPB_SUPPORT_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_SPB_SUPPORT_MASK)

#define OSCCA_SAFO_SGI_CONFIG_SPB_MASKING_MASK   (0x4000000U)
#define OSCCA_SAFO_SGI_CONFIG_SPB_MASKING_SHIFT  (26U)
/*! SPB_MASKING - ID_CFG_SAFO_SGI_SPB_MASKING is set */
#define OSCCA_SAFO_SGI_CONFIG_SPB_MASKING(x)     (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_SPB_MASKING_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_SPB_MASKING_MASK)

#define OSCCA_SAFO_SGI_CONFIG_SFR_SW_MASK_MASK   (0x8000000U)
#define OSCCA_SAFO_SGI_CONFIG_SFR_SW_MASK_SHIFT  (27U)
/*! SFR_SW_MASK - ID_CFG_SAFO_SGI_USE_SFR_SW_MASK is set */
#define OSCCA_SAFO_SGI_CONFIG_SFR_SW_MASK(x)     (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_SFR_SW_MASK_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_SFR_SW_MASK_MASK)

#define OSCCA_SAFO_SGI_CONFIG_HAS_SM3_MASK       (0x10000000U)
#define OSCCA_SAFO_SGI_CONFIG_HAS_SM3_SHIFT      (28U)
/*! HAS_SM3 - Has SM3 */
#define OSCCA_SAFO_SGI_CONFIG_HAS_SM3(x)         (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_HAS_SM3_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_HAS_SM3_MASK)

#define OSCCA_SAFO_SGI_CONFIG_HAS_SM4_MASK       (0x20000000U)
#define OSCCA_SAFO_SGI_CONFIG_HAS_SM4_SHIFT      (29U)
/*! HAS_SM4 - Has SM4 */
#define OSCCA_SAFO_SGI_CONFIG_HAS_SM4(x)         (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_CONFIG_HAS_SM4_SHIFT)) & OSCCA_SAFO_SGI_CONFIG_HAS_SM4_MASK)
/*! @} */

/*! @name SAFO_SGI_INT_ENABLE - Interrupt Enable */
/*! @{ */

#define OSCCA_SAFO_SGI_INT_ENABLE_INT_EN_MASK    (0x1U)
#define OSCCA_SAFO_SGI_INT_ENABLE_INT_EN_SHIFT   (0U)
/*! INT_EN - Interrupt enable bit */
#define OSCCA_SAFO_SGI_INT_ENABLE_INT_EN(x)      (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_INT_ENABLE_INT_EN_SHIFT)) & OSCCA_SAFO_SGI_INT_ENABLE_INT_EN_MASK)
/*! @} */

/*! @name SAFO_SGI_INT_STATUS_CLR - Interrupt Status Clear */
/*! @{ */

#define OSCCA_SAFO_SGI_INT_STATUS_CLR_INT_CLR_MASK (0x1U)
#define OSCCA_SAFO_SGI_INT_STATUS_CLR_INT_CLR_SHIFT (0U)
/*! INT_CLR - Interrupt Status Clear */
#define OSCCA_SAFO_SGI_INT_STATUS_CLR_INT_CLR(x) (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_INT_STATUS_CLR_INT_CLR_SHIFT)) & OSCCA_SAFO_SGI_INT_STATUS_CLR_INT_CLR_MASK)
/*! @} */

/*! @name SAFO_SGI_INT_STATUS_SET - Interrupt Status Set */
/*! @{ */

#define OSCCA_SAFO_SGI_INT_STATUS_SET_INT_SET_MASK (0x1U)
#define OSCCA_SAFO_SGI_INT_STATUS_SET_INT_SET_SHIFT (0U)
/*! INT_SET - Set Interrupt by SW */
#define OSCCA_SAFO_SGI_INT_STATUS_SET_INT_SET(x) (((uint32_t)(((uint32_t)(x)) << OSCCA_SAFO_SGI_INT_STATUS_SET_INT_SET_SHIFT)) & OSCCA_SAFO_SGI_INT_STATUS_SET_INT_SET_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group OSCCA_Register_Masks */


/*!
 * @}
 */ /* end of group OSCCA_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_OSCCA_H_ */

